import React, { useRef, useState } from "react";
import "./index.css";
import { SearchOutlined } from "@ant-design/icons";

import type { InputRef } from "antd";
import { Button, Input, Space, Table, Image } from "antd";
import type { ColumnType, ColumnsType } from "antd/es/table";
import type { FilterConfirmProps } from "antd/es/table/interface";
import dayjs from "dayjs";
import { map } from "lodash-es";

interface DataType {
  [key: string]: any;
}

type DataIndex = keyof DataType;

const data = [
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_215197.shtml",
    propic:
      "W020230925409525756619.png;W020230925409526259658.png;W020230925409526759842.png;W020230925409527329796.png;W020230925409527844267.png;W020230925409528317918.png|2309573,2309574,2309575,2309576,2309577,2309578",
    pcode: "B00V65000",
    pname: "633升多门冰箱",
    psale_time: "1679241600000",
    metaDataId: 215197,
    modelno: "BCD-633WLCFDA4A5U1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"天成"},{"箱门结构":"多门"},{"总容积(L)":"633"},{"面板颜色":"晶钻黛"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"702","KEY":"深度"},{"VALUE":"905","KEY":"宽度"},{"VALUE":"1901","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"36"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"157"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"385"},{"冷冻室容积(L)":"228"},{"变温室容积(L)":"20"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"1.06"},{"冷冻能力(kg/12h)":"10"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"2"},{"果菜盒(个)":"1"},{"变温抽屉(个)":"1"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 21999.0,
    psale: "0",
    appFile: "W020230925409525756619.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214927.shtml",
    propic:
      "W020230921676032229517.png;W020230921676032542281.png;W020230921676032893981.png;W020230921676033231469.png;W020230921676033599139.png;W020230921676033925453.png;W020230921676034259676.png|2302870,2302871,2302872,2302873,2302874,2302875,2302876",
    pcode: "B00482000",
    pname: "603升多门冰箱",
    psale_time: "1677600000000",
    metaDataId: 214927,
    modelno: "BCD-603WGCRTM7WKU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"天成"},{"箱门结构":"多门"},{"总容积(L)":"603"},{"面板颜色":"云岩白"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"702","KEY":"深度"},{"VALUE":"905","KEY":"宽度"},{"VALUE":"1900","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"36"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"145"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"278"},{"冷冻室容积(L)":"263"},{"变温室容积(L)":"62"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"1.06"},{"冷冻能力(kg/12h)":"10"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"6"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"1"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 15999.0,
    psale: "0",
    appFile: "W020230921676032229517.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214928.shtml",
    propic:
      "W020230921388364047311.png;W020230921388364399798.png;W020230921388364743409.png;W020230921388365125444.png;W020230921388365472342.png;W020230921388365839272.png|2298570,2298571,2298572,2298573,2298574,2298575",
    pcode: "BC10Z1000",
    pname: "609升十字对开门冰箱",
    psale_time: "1672675200000",
    metaDataId: 214928,
    modelno: "BCD-609WLCTDA4VRU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"天成"},{"箱门结构":"十字对开门"},{"总容积(L)":"609"},{"面板颜色":"幻影紫"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"702","KEY":"深度"},{"VALUE":"905","KEY":"宽度"},{"VALUE":"1901","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"36"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"159"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"409"},{"冷冻室容积(L)":"100"},{"变温室容积(L)":"100"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"0.99"},{"冷冻能力(kg/12h)":"6.5"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"2"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"2"},{"瓶座(个)":"4"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 25999.0,
    psale: "0",
    appFile: "W020230921388364047311.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214929.shtml",
    propic:
      "W020230921388477152839.png;W020230921388477489362.png;W020230921388477839121.png;W020230921388478155320.png;W020230921388478517032.png;W020230921388478867351.png;W020230921388479196206.png|2298592,2298593,2298594,2298595,2298596,2298597,2298598",
    pcode: "BH0480000",
    pname: "603升多门冰箱",
    psale_time: "1669824000000",
    metaDataId: 214929,
    modelno: "BCD-603WGCRTM7C3U1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"天成"},{"箱门结构":"多门"},{"总容积(L)":"603"},{"面板颜色":"锡兰青"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"702","KEY":"深度"},{"VALUE":"905","KEY":"宽度"},{"VALUE":"1900","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"36"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"145"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"278"},{"冷冻室容积(L)":"263"},{"变温室容积(L)":"62"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"1.06"},{"冷冻能力(kg/12h)":"10"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"6"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"1"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 15999.0,
    psale: "0",
    appFile: "W020230921388477152839.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214931.shtml",
    propic:
      "W020230921676780157215.png;W020230921676780490729.png;W020230921676780834234.png;W020230921676781182769.png;W020230921676781514363.png;W020230921676781878039.png|2302927,2302928,2302929,2302930,2302931,2302932",
    pcode: "B00480000",
    pname: "603升多门冰箱",
    psale_time: "1669824000000",
    metaDataId: 214931,
    modelno: "BCD-603WGCRTM7S5U1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"天成"},{"箱门结构":"多门"},{"总容积(L)":"603"},{"面板颜色":"帛拉蒂【影雕】"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"702","KEY":"深度"},{"VALUE":"905","KEY":"宽度"},{"VALUE":"1900","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"36"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"触摸"},{"重量(kg)":"145"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"278"},{"冷冻室容积(L)":"263"},{"变温室容积(L)":"62"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"1.06"},{"冷冻能力(kg/12h)":"10"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"6"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"1"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 15999.0,
    psale: "0",
    appFile: "W020230921676780157215.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214920.shtml",
    propic:
      "W020230921387459227265.png;W020230921387459576077.png;W020230921387459941686.png;W020230921387460291033.png;W020230921387460675011.png;W020230921387461281405.png;W020230921387461728074.png;W020230921387462071020.png|2298391,2298392,2298393,2298394,2298395,2298396,2298397,2298398",
    pcode: "B00V64000",
    pname: "633升多门冰箱",
    psale_time: "1667232000000",
    metaDataId: 214920,
    modelno: "BCD-633WLCFDA4ARU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"天成"},{"箱门结构":"多门"},{"总容积(L)":"633"},{"面板颜色":"幻影黛"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"702","KEY":"深度"},{"VALUE":"905","KEY":"宽度"},{"VALUE":"1901","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"36"},{"面板材质":"彩晶"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"触摸"},{"重量(kg)":"157"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"385"},{"冷冻室容积(L)":"228"},{"变温室容积(L)":"20"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"1.06"},{"冷冻能力(kg/12h)":"10"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"2"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"1"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 21999.0,
    psale: "0",
    appFile: "W020230921387459227265.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214918.shtml",
    propic:
      "W020230921387144850251.png;W020230921387145300275.png;W020230921387145758342.png;W020230921387146190264.png;W020230921387146660527.png;W020230921387147088097.png;W020230921387147575059.png|2298344,2298345,2298346,2298347,2298348,2298349,2298350",
    pcode: "BC10Z2000",
    pname: "609升十字对开门冰箱",
    psale_time: "1666195200000",
    metaDataId: 214918,
    modelno: "BCD-609WLCTDA4ARU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"天成"},{"箱门结构":"十字对开门"},{"总容积(L)":"609"},{"面板颜色":"幻影黛"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"702","KEY":"深度"},{"VALUE":"905","KEY":"宽度"},{"VALUE":"1901","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"36"},{"面板材质":"彩晶"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"触摸"},{"重量(kg)":"157"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"409"},{"冷冻室容积(L)":"100"},{"变温室容积(L)":"100"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"0.99"},{"冷冻能力(kg/12h)":"6.5"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"2"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"2"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 21999.0,
    psale: "0",
    appFile: "W020230921387144850251.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214925.shtml",
    propic:
      "W020230921388006306639.png;W020230921388006671446.png;W020230921388007051998.png;W020230921388007420998.png;W020230921388007784551.png;W020230921388008149424.png|2298511,2298512,2298513,2298514,2298515,2298516",
    pcode: "B00VC0000",
    pname: "777升多门冰箱",
    psale_time: "1664467200000",
    metaDataId: 214925,
    modelno: "BCD-777WLCFDGAVRU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"朗度"},{"箱门结构":"多门"},{"总容积(L)":"777"},{"面板颜色":"晶钻紫"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"787","KEY":"深度"},{"VALUE":"1005","KEY":"宽度"},{"VALUE":"1900","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"36"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"触摸"},{"重量(kg)":"210"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"466"},{"冷冻室容积(L)":"273"},{"变温室容积(L)":"38"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"1.08"},{"冷冻能力(kg/12h)":"11"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"2"},{"果菜盒(个)":""},{"变温抽屉(个)":"2"},{"瓶座(个)":"3"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 43999.0,
    psale: "0",
    appFile: "W020230921388006306639.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214905.shtml",
    propic:
      "W020230921525450413388.png;W020230921525450782462.png;W020230921525451157333.png;W020230921525451514862.png;W020230921525451873283.png;W020230921525452242374.png;W020230921525452584644.png|2300032,2300033,2300034,2300035,2300036,2300037,2300038",
    pcode: "BH03ZK000",
    pname: "600升对开门冰箱",
    psale_time: "1662134400000",
    metaDataId: 214905,
    modelno: "BCD-600WGCSSM7WYU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"新颜值"},{"箱门结构":"对开门"},{"总容积(L)":"600"},{"面板颜色":"冰极岩"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"697","KEY":"深度"},{"VALUE":"908","KEY":"宽度"},{"VALUE":"1775","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"38"},{"面板材质":"钣金"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"机械"},{"重量(kg)":"100"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"382"},{"冷冻室容积(L)":"192"},{"变温室容积(L)":""},{"二星级容积(L)":"26"},{"综合耗电量(kW·h/24h)":"0.98"},{"冷冻能力(kg/12h)":"8.7"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"8"},{"果菜盒(个)":"1"},{"变温抽屉(个)":"1"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 9999.0,
    psale: "0",
    appFile: "W020230921525450413388.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214917.shtml",
    propic:
      "W020230921387018365186.png;W020230921387018736128.png;W020230921387019132764.png;W020230921387019525764.png;W020230921387019909244.png;W020230921387020263214.png|2298322,2298323,2298324,2298325,2298326,2298327",
    pcode: "BH03ZP000",
    pname: "600升对开门冰箱",
    psale_time: "1662134400000",
    metaDataId: 214917,
    modelno: "BCD-600WGCSSM7SYU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"新颜值"},{"箱门结构":"对开门"},{"总容积(L)":"600"},{"面板颜色":"辰月灰"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"697","KEY":"深度"},{"VALUE":"908","KEY":"宽度"},{"VALUE":"1775","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"38"},{"面板材质":"钣金"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"机械"},{"重量(kg)":"90"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"382"},{"冷冻室容积(L)":"192"},{"变温室容积(L)":""},{"二星级容积(L)":"26"},{"综合耗电量(kW·h/24h)":"0.98"},{"冷冻能力(kg/12h)":"8.7"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"8"},{"果菜盒(个)":"1"},{"变温抽屉(个)":"1"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 9999.0,
    psale: "0",
    appFile: "W020230921387018365186.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214913.shtml",
    propic:
      "W020230921386576779882.png;W020230921386577146314.png;W020230921386577500955.png;W020230921386577869808.png;W020230921386578196581.png;W020230921386578566563.png;W020230921386578922455.png|2298240,2298241,2298242,2298243,2298244,2298245,2298246",
    pcode: "BH03ZM000",
    pname: "600升对开门冰箱",
    psale_time: "1662134400000",
    metaDataId: 214913,
    modelno: "BCD-600WGCSSM7DEU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"新颜值"},{"箱门结构":"对开门"},{"总容积(L)":"600"},{"面板颜色":"青岚"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"697","KEY":"深度"},{"VALUE":"908","KEY":"宽度"},{"VALUE":"1775","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"38"},{"面板材质":"钣金"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"机械"},{"重量(kg)":"100"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"382"},{"冷冻室容积(L)":"192"},{"变温室容积(L)":""},{"二星级容积(L)":"26"},{"综合耗电量(kW·h/24h)":"0.98"},{"冷冻能力(kg/12h)":"8.7"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"8"},{"果菜盒(个)":"1"},{"变温抽屉(个)":"1"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 9999.0,
    psale: "0",
    appFile: "W020230921386576779882.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214904.shtml",
    propic:
      "W020230921525361698951.png;W020230921525362068771.png;W020230921525362421831.png;W020230921525362784204.png;W020230921525363130054.png;W020230921525363483029.png;W020230921525363932346.png|2300009,2300010,2300011,2300012,2300013,2300014,2300015",
    pcode: "BC1193000",
    pname: "700升十字对开门冰箱",
    psale_time: "1660924800000",
    metaDataId: 214904,
    modelno: "BCD-700WGCTDM7WYU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"新颜值"},{"箱门结构":"十字对开门"},{"总容积(L)":"700"},{"面板颜色":"冰极岩"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"748","KEY":"深度"},{"VALUE":"905","KEY":"宽度"},{"VALUE":"1900","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"37"},{"面板材质":"钣金"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"触摸"},{"重量(kg)":"140"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"466"},{"冷冻室容积(L)":"116"},{"变温室容积(L)":"118"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"0.98"},{"冷冻能力(kg/12h)":"6.5"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"3"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"2"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 15999.0,
    psale: "0",
    appFile: "W020230921525361698951.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214919.shtml",
    propic:
      "W020230921387262718181.png;W020230921387263074307.png;W020230921387263432281.png;W020230921387263795402.png;W020230921387264174210.png;W020230921387264532617.png|2298369,2298370,2298371,2298372,2298373,2298374",
    pcode: "BC10Z0000",
    pname: "609升十字对开门冰箱",
    psale_time: "1656691200000",
    metaDataId: 214919,
    modelno: "BCD-609WLCTDM4A5U1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"天成"},{"箱门结构":"十字对开门"},{"总容积(L)":"609"},{"面板颜色":"晶钻黛"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"702","KEY":"深度"},{"VALUE":"905","KEY":"宽度"},{"VALUE":"1901","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"36"},{"面板材质":"彩晶"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"触摸"},{"重量(kg)":"145"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"409"},{"冷冻室容积(L)":"100"},{"变温室容积(L)":"100"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"0.99"},{"冷冻能力(kg/12h)":"6.5"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"2"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"2"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 19999.0,
    psale: "0",
    appFile: "W020230921387262718181.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214347.shtml",
    propic:
      "W020230925663732336564.png;W020230925663732655970.png;W020230925663732998321.png;W020230925663733331613.png;W020230925663733720340.png;W020230925663734073804.png|2312311,2312312,2312313,2312314,2312315,2312316",
    pcode: "BH03R0000",
    pname: "801升对开门冰箱",
    psale_time: "1652716800000",
    metaDataId: 214347,
    modelno: "BCD-801WLCSS79W1U1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"朗度"},{"箱门结构":"对开门"},{"总容积(L)":"801"},{"面板颜色":"纯白"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"756","KEY":"深度"},{"VALUE":"1005","KEY":"宽度"},{"VALUE":"1904","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"38"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"177"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"467"},{"冷冻室容积(L)":"312"},{"变温室容积(L)":"22"},{"综合耗电量(kW·h/24h)":"1.3"},{"冷冻能力(kg/12h)":"10"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"6"},{"果菜盒(个)":"3"},{"变温抽屉(个)":"1"},{"瓶座(个)":"10"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 18999.0,
    psale: "0",
    appFile: "W020230925663732336564.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214346.shtml",
    propic:
      "W020230915543214839834.png;W020230915543215184508.png;W020230915543215548354.png;W020230915543215899460.png;W020230915543216404698.png;W020230915543216858329.png|2284268,2284269,2284270,2284271,2284272,2284273",
    pcode: "BH03Q4000",
    pname: "643升对开门冰箱",
    psale_time: "1652630400000",
    metaDataId: 214346,
    modelno: "BCD-643WLCSS79W1U1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"新颜值"},{"箱门结构":"对开门"},{"总容积(L)":"643"},{"面板颜色":"白色"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"738","KEY":"深度"},{"VALUE":"908","KEY":"宽度"},{"VALUE":"1800","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"38"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"122"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"413"},{"冷冻室容积(L)":"230"},{"变温室容积(L)":""},{"综合耗电量(kW·h/24h)":"0.99"},{"冷冻能力(kg/12h)":"9"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"8"},{"果菜盒(个)":"1"},{"变温抽屉(个)":""},{"瓶座(个)":"7"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 10999.0,
    psale: "0",
    appFile: "W020230915543214839834.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214363.shtml",
    propic:
      "W020230915544696069602.png;W020230915544696463922.png;W020230915544696863002.png;W020230915544697334733.png;W020230915544697794530.png;W020230915544698304212.png|2284791,2284792,2284793,2284794,2284795,2284796",
    pcode: "BC1192000",
    pname: "700升十字对开门冰箱",
    psale_time: "1650729600000",
    metaDataId: 214363,
    modelno: "BCD-700WGCTDM7DSU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"新颜值"},{"箱门结构":"十字对开门"},{"总容积(L)":"700"},{"面板颜色":"丝墨青"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"748","KEY":"深度"},{"VALUE":"908","KEY":"宽度"},{"VALUE":"1905","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"37"},{"面板材质":""},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"140"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"466"},{"冷冻室容积(L)":"116"},{"变温室容积(L)":"118"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"0.98"},{"冷冻能力(kg/12h)":"6.5"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"3"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"2"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 15999.0,
    psale: "0",
    appFile: "W020230915544696069602.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214342.shtml",
    propic:
      "W020230915542905257634.png;W020230915542905605151.png;W020230915542905976405.png;W020230915542906365728.png;W020230915542906852737.png;W020230915542907304811.png;W020230915542907697971.png|2284170,2284171,2284172,2284173,2284174,2284175,2284176",
    pcode: "BC1191000",
    pname: "700升十字对开门冰箱",
    psale_time: "1650211200000",
    metaDataId: 214342,
    modelno: "BCD-700WGCTD87C3U1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"新颜值"},{"箱门结构":"十字对开门"},{"总容积(L)":"700"},{"面板颜色":"锡兰靑"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"748","KEY":"深度"},{"VALUE":"908","KEY":"宽度"},{"VALUE":"1905","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"37"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"142"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"466"},{"冷冻室容积(L)":"116"},{"变温室容积(L)":"118"},{"综合耗电量(kW·h/24h)":"0.98"},{"冷冻能力(kg/12h)":"6.5"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"3"},{"果菜盒(个)":"1"},{"变温抽屉(个)":"2"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 15999.0,
    psale: "0",
    appFile: "W020230915542905257634.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214902.shtml",
    propic:
      "W020230921525083001195.png;W020230921525083385581.png;W020230921525083773892.png;W020230921525084159445.png;W020230921525084619815.png;W020230921525085109202.png|2299960,2299961,2299962,2299963,2299964,2299965",
    pcode: "BH03Q5000",
    pname: "643升对开门冰箱",
    psale_time: "1648656000000",
    metaDataId: 214902,
    modelno: "BCD-643WLCSS79MNU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"新颜值"},{"箱门结构":"对开门"},{"总容积(L)":"643"},{"面板颜色":"希缇棕"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"738","KEY":"深度"},{"VALUE":"908","KEY":"宽度"},{"VALUE":"1800","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"38"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"130"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"413"},{"冷冻室容积(L)":"230"},{"变温室容积(L)":""},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"0.99"},{"冷冻能力(kg/12h)":"9"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"8"},{"果菜盒(个)":"1"},{"变温抽屉(个)":""},{"瓶座(个)":"7"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 10999.0,
    psale: "0",
    appFile: "W020230921525083001195.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214360.shtml",
    propic:
      "W020230915544406963059.png;W020230915544407328556.png;W020230915544407699479.png;W020230915544408082954.png;W020230915544408484272.png;W020230915544408879199.png|2284680,2284681,2284682,2284683,2284684,2284685",
    pcode: "BC1143000",
    pname: "650升十字对开门冰箱",
    psale_time: "1632326400000",
    metaDataId: 214360,
    modelno: "BCD-650WLCTD79G3U1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"新颜值"},{"箱门结构":"十字对开门"},{"总容积(L)":"650"},{"面板颜色":"极致灰"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"738","KEY":"深度"},{"VALUE":"908","KEY":"宽度"},{"VALUE":"1905","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"38"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":"触控"},{"重量(kg)":"145"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"442"},{"冷冻室容积(L)":"104"},{"变温室容积(L)":"104"},{"二星级容积(L)":""},{"综合耗电量(kW·h/24h)":"0.95"},{"冷冻能力(kg/12h)":"6.5"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"3"},{"果菜盒(个)":"2"},{"变温抽屉(个)":"2"},{"瓶座(个)":"6"},{"冷冻抽屉(个)":"2"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 12999.0,
    psale: "0",
    appFile: "W020230915544406963059.png",
    channelId: 42561,
  },
  {
    docPubUrl: "//www.casarte.com/cooling/20231010_214334.shtml",
    propic:
      "W020230915541826281560.png;W020230915541826718220.png;W020230915541827149544.png;W020230915541827560231.png;W020230915541828006051.png;W020230915541828408103.png|2283920,2283921,2283922,2283923,2283924,2283925",
    pcode: "BH03S5000",
    pname: "600升对开门冰箱",
    psale_time: "1631808000000",
    metaDataId: 214334,
    modelno: "BCD-600WLCSSA9VAU1",
    specifications:
      '{"GROUP":[{"Field":[{"产品系列":"天成"},{"箱门结构":"对开门"},{"总容积(L)":"600"},{"面板颜色":"远山黛"},{"能效等级":"1级"},{"产品尺寸(深*宽*高)mm":[{"VALUE":"697","KEY":"深度"},{"VALUE":"910","KEY":"宽度"},{"VALUE":"1905","KEY":"高度"}]}],"name":"基本参数"},{"Field":[{"噪声dB(A)":"37"},{"面板材质":"钢化玻璃"},{"压缩机":"变频"},{"制冷方式":"风冷"},{"控温方式":"电脑"},{"按键方式":""},{"重量(kg)":"133"},{"额定电压(V)":"220"},{"额定频率(Hz)":"50"},{"冷藏室容积(L)":"311"},{"冷冻室容积(L)":"289"},{"软冷冻室容积(L)":""},{"综合耗电量(kW·h/24h)":"1.05"},{"冷冻能力(kg/12h)":"8"}],"name":"规格参数"},{"Field":[{"搁物架(个)":"6"},{"果菜盒(个)":"3"},{"变温抽屉(个)":""},{"瓶座(个)":"3"},{"冷冻抽屉(个)":"3"}],"name":"配置参数"}]}',
    promoteUrlCounts: 0,
    price: 16999.0,
    psale: "0",
    appFile: "W020230915541826281560.png",
    channelId: 42561,
  },
];

const App: React.FC = () => {
  const [searchText, setSearchText] = useState("");
  const [searchedColumn, setSearchedColumn] = useState("");
  const searchInput = useRef<InputRef>(null);

  const handleSearch = (
    selectedKeys: string[],
    confirm: (param?: FilterConfirmProps) => void,
    dataIndex: DataIndex
  ) => {
    confirm();
    setSearchText(selectedKeys[0]);
    setSearchedColumn(dataIndex as any);
  };

  const handleReset = (clearFilters: () => void) => {
    clearFilters();
    setSearchText("");
  };

  const columns: ColumnsType<DataType> = [
    {
      title: "产品名称",
      dataIndex: "pname",
      key: "pname",
      width: 150,
      render: (_0, { pname, docPubUrl }) => {
        return (
          <a href={docPubUrl} target="_blank">
            {pname}
          </a>
        );
      },
    },
    {
      title: "型号",
      dataIndex: "modelno",
      key: "modelno",
    },
    {
      title: "参考价",
      width: 80,
      dataIndex: "price",
      key: "price",
    },
    {
      title: "发售时间",
      dataIndex: "psale_time",
      key: "psale_time",
      width: 100,
      render: (v) => {
        return dayjs(Number(v)).format("YYYY-MM-DD");
      },
    },
    {
      title: "参数",
      dataIndex: "specifications",
      key: "specifications",
      render: (v) => {
        let group;
        try {
          group = JSON.parse(v)?.GROUP;
        } catch (error) {}

        return (
          <div style={{ display: "flex" }}>
            {group.map((i) => {
              console.log("i :>> ", i);
              return (
                <div>
                  <div style={{ fontWeight: 900, fontSize: "18px" }}>
                    {i.name}
                  </div>
                  {i.Field.map((v) => {
                    return map(v, (value, key) => {
                      if (Array.isArray(value)) {
                        return map(value, (z) => {
                          return `${z.KEY}: ${z.VALUE} `;
                        });
                      }
                      return (
                        <div>
                          {key}: {value}
                        </div>
                      );
                    });
                  })}
                </div>
              );
            })}
          </div>
        );
      },
    },
    {
      title: "图片",
      dataIndex: "docPubUrl",
      key: "docPubUrl",
      render: (_0, { appFile }) => {
        return (
          <Image
            width={200}
            src={`https://image.casarte.com/cooling/${appFile}`}
            referrerPolicy="no-referrer"
          />
        );
      },
    },
  ];

  return (
    <Table
      size="small"
      columns={columns}
      dataSource={data}
      pagination={false}
    />
  );
};

export default App;
